adamberlinger/zero_elab/target/stm32x0_usb_cdc/usb_bsp.c
/*
 * BSD 3-Clause License
 * 
 * Copyright (c) 2016-2022, Adam Berlinger
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from
 *    this software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "usb_bsp.h"

int usb_clk_init(void){
#ifdef STM32F1XX
  RCC->APB1ENR |= RCC_APB1ENR_USBEN;
#else

#ifdef STM32C0XX
  RCC->APBENR2 |= RCC_APBENR2_SYSCFGEN;
  RCC->APBENR1 |= RCC_APBENR1_CRSEN | RCC_APBENR1_USBEN;
#else
  RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
  RCC->APB1ENR |= RCC_APB1ENR_CRSEN | RCC_APB1ENR_USBEN;
#endif

#ifdef STM32L0XX
  if(!(SYSCFG->CFGR3 & (0x1 << 26))){
    uint32_t tries = 0x2000000;
    SYSCFG->CFGR3 |= SYSCFG_CFGR3_ENREF_HSI48 | 0x1;
    while(!(SYSCFG->CFGR3 & (0x1 << 26))){
      tries--;
      if(tries == 0){
        return -1;
      }
    }
  }
#endif

#ifdef STM32F0
  if(!(RCC->CR & RCC_CR2_HSI48RDY)){
    uint32_t tries = 0x2000000;
    RCC->CR2 |= RCC_CR2_HSI48ON;
    while(!(RCC->CR2 & RCC_CR2_HSI48RDY)){
      tries--;
      if(tries == 0){
        return -1;
      }
    }
  }
#elif defined(STM32C0XX)
  if(!(RCC->CR & RCC_CR_HSIUSB48RDY)){
    uint32_t tries = 0x2000000;
    RCC->CR |= RCC_CR_HSIUSB48ON;
    while(!(RCC->CR & RCC_CR_HSIUSB48RDY)){
      tries--;
      if(tries == 0){
        return -1;
      }
    }
  }

  /* HSI48 clocks used by default */
#else
  if(!(RCC->CRRCR & RCC_CRRCR_HSI48RDY)){
    uint32_t tries = 0x2000000;
    RCC->CRRCR |= RCC_CRRCR_HSI48ON;
    while(!(RCC->CRRCR & RCC_CRRCR_HSI48RDY)){
      tries--;
      if(tries == 0){
        return -1;
      }
    }
  }

  RCC->CCIPR |= RCC_CCIPR_HSI48SEL;
#endif

  CRS->CR |= CRS_CR_AUTOTRIMEN | CRS_CR_CEN;
#endif /* ifdef STM32F1XX */
  return 0;
}

#ifdef STM32F1XX
void usb_handler();

void usb_lp_handler(){
  usb_handler();
}

void usb_hp_handler(){
  usb_handler();
}
#endif

void usb_nvic_init(void){
#ifdef STM32F1XX
  NVIC_EnableIRQ(USB_HP_CAN1_TX_IRQn);
  NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);
#elif defined(STM32C0XX)
  NVIC_EnableIRQ(USB_DRD_FS_IRQn);
#else
  NVIC_EnableIRQ(USB_IRQn);
#endif
}

int usb_bsp_init(void){
  if(usb_clk_init()){
    return -1;
  }
  usb_nvic_init();
  return 0;
}
